Revit 2026 API

# RebarHostDataGetCommonCoverType Method

---

If all exposed faces of the host have the same associated CoverType, return that CoverType; otherwise, return .

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarCoverType GetCommonCoverType()
```
```vb
Public Function GetCommonCoverType As RebarCoverType
```
```cpp
public:
RebarCoverType^ GetCommonCoverType()
```
```fsharp
member GetCommonCoverType : unit -> RebarCoverType
```

#### Return Value

RebarCoverType The common CoverType for all exposed faces, or  if there are multiple CoverTypes.

#### Reference

RebarHostData Class

Autodesk.Revit.DB.Structure Namespace